############################# PANDAS #########################

why pandas?

1. Import datasets
2. Data cleansing
3. Size mutability
4. Reshaping and pivoting of datasets
5. Efficient manipulation and extraction
6. Statistical analysis

2 Primary Data Structure 

1. Series
2. DataFrame

Data structure are collection of data types that provide the best way of organizing the (values) in terms of memory usage

1. Series --> A one dimensional labeled homogeneous array, size immutable.

2. DataFrame--> A two-dimensional labeled, Size-mutable tabular structure with potentially heterogeneously typed
columns

In [2]:
import pandas as pd

In [3]:
s=pd.Series([10,20,30,40,50])
s

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [4]:
s.dtype

dtype('int64')

In [5]:
s.values

array([10, 20, 30, 40, 50])

In [6]:
s.index

RangeIndex(start=0, stop=5, step=1)

In [7]:
print(s.name)

None

In [8]:
s.name="Numbers"
s

0    10
1    20
2    30
3    40
4    50
Name: Numbers, dtype: int64

In [9]:
#Indexing 
s[0]

np.int64(10)

In [10]:
s[0:2] #Start(included): stop (excluded): step value (values to jump)

0    10
1    20
Name: Numbers, dtype: int64

In [11]:
s[2:4]

2    30
3    40
Name: Numbers, dtype: int64

In [12]:
# iloc ->location bassed indexing

s.iloc[3]

np.int64(40)

In [13]:
s.iloc[[1,3,4]]

1    20
3    40
4    50
Name: Numbers, dtype: int64

In [14]:
s.name="calories"
s

0    10
1    20
2    30
3    40
4    50
Name: calories, dtype: int64

In [15]:
index=['apple','banana','grapes','orange','strawberry']
s.index=index
s

apple         10
banana        20
grapes        30
orange        40
strawberry    50
Name: calories, dtype: int64

In [16]:
s['grapes']

np.int64(30)

In [17]:
s.iloc[3] #-->iloc works only if you know the indexes

np.int64(40)

In [18]:
# loc --> label based indexing
s.loc['grapes']

np.int64(30)

In [19]:
# In label based indexing your start as well as stop values both are included in the output. 
s.loc['banana':'orange']

banana    20
grapes    30
orange    40
Name: calories, dtype: int64

In [20]:
s.loc[['orange','apple']]

orange    40
apple     10
Name: calories, dtype: int64

In [21]:
fruit_protein={
    "Avocado":2.0,     # grams of protein
    'Guava':2.6,
    "Blackberries":2.0,
    "oranges":0.9,
    "Banana":1.1,
    "Apples":0.3,
    "Kiwi":1.1,
    "promegranate":1.7,
    "mango":0.8,
    "Cherries":1.0
    
}

fruit_protein

{'Avocado': 2.0,
 'Guava': 2.6,
 'Blackberries': 2.0,
 'oranges': 0.9,
 'Banana': 1.1,
 'Apples': 0.3,
 'Kiwi': 1.1,
 'promegranate': 1.7,
 'mango': 0.8,
 'Cherries': 1.0}

In [22]:
s2=pd.Series(fruit_protein,name="Protein")
s2

Avocado         2.0
Guava           2.6
Blackberries    2.0
oranges         0.9
Banana          1.1
Apples          0.3
Kiwi            1.1
promegranate    1.7
mango           0.8
Cherries        1.0
Name: Protein, dtype: float64

In [23]:
s2.iloc[3]

np.float64(0.9)

In [24]:
s2.loc[['Banana','mango']]

Banana    1.1
mango     0.8
Name: Protein, dtype: float64

In [25]:
s2

Avocado         2.0
Guava           2.6
Blackberries    2.0
oranges         0.9
Banana          1.1
Apples          0.3
Kiwi            1.1
promegranate    1.7
mango           0.8
Cherries        1.0
Name: Protein, dtype: float64

In [26]:
# Coditional Selection

s2>1

Avocado          True
Guava            True
Blackberries     True
oranges         False
Banana           True
Apples          False
Kiwi             True
promegranate     True
mango           False
Cherries        False
Name: Protein, dtype: bool

In [27]:
s2[s2>1]

Avocado         2.0
Guava           2.6
Blackberries    2.0
Banana          1.1
Kiwi            1.1
promegranate    1.7
Name: Protein, dtype: float64

In [28]:
s2

Avocado         2.0
Guava           2.6
Blackberries    2.0
oranges         0.9
Banana          1.1
Apples          0.3
Kiwi            1.1
promegranate    1.7
mango           0.8
Cherries        1.0
Name: Protein, dtype: float64

In [29]:
# Logical Operators:-->(and, or , not)
[(s2>0.5) & (s2<2)]

[Avocado         False
 Guava           False
 Blackberries    False
 oranges          True
 Banana           True
 Apples          False
 Kiwi             True
 promegranate     True
 mango            True
 Cherries         True
 Name: Protein, dtype: bool]

In [30]:
 # or operators
s2[(s2>0.5) | (s2<=2)]

Avocado         2.0
Guava           2.6
Blackberries    2.0
oranges         0.9
Banana          1.1
Apples          0.3
Kiwi            1.1
promegranate    1.7
mango           0.8
Cherries        1.0
Name: Protein, dtype: float64

In [31]:
# not operation:
[~(s2>1)]

[Avocado         False
 Guava           False
 Blackberries    False
 oranges          True
 Banana          False
 Apples           True
 Kiwi            False
 promegranate    False
 mango            True
 Cherries         True
 Name: Protein, dtype: bool]

In [32]:
s2[~(s2>1)]

oranges     0.9
Apples      0.3
mango       0.8
Cherries    1.0
Name: Protein, dtype: float64

In [33]:
s2

Avocado         2.0
Guava           2.6
Blackberries    2.0
oranges         0.9
Banana          1.1
Apples          0.3
Kiwi            1.1
promegranate    1.7
mango           0.8
Cherries        1.0
Name: Protein, dtype: float64

In [34]:
# Modyfying the series

s2["mango"]=2.8
s2

Avocado         2.0
Guava           2.6
Blackberries    2.0
oranges         0.9
Banana          1.1
Apples          0.3
Kiwi            1.1
promegranate    1.7
mango           2.8
Cherries        1.0
Name: Protein, dtype: float64

In [35]:
import numpy as np
ser=pd.Series(["a",np.nan,1,np.nan,2])
print('Not null values',ser.notnull().sum())
print('is null values',ser.isnull().sum())

Not null values 3
is null values 2

DataFrame

In [36]:
#DataFrame
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve", "Alice"],
    "Age": [25, 30, 35, np.nan, 29, 25],
    "Department": ["HR", "IT", "Finance", "IT", "HR", "HR"],
    "Salary": [50000, 60000, 70000, 62000, np.nan, 50000]
}

In [37]:
data

{'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Alice'],
 'Age': [25, 30, 35, nan, 29, 25],
 'Department': ['HR', 'IT', 'Finance', 'IT', 'HR', 'HR'],
 'Salary': [50000, 60000, 70000, 62000, nan, 50000]}

In [38]:
df=pd.DataFrame(data)
df

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN
5    Alice  25.0         HR  50000.0

In [39]:
df.head(2)

    Name   Age Department   Salary
0  Alice  25.0         HR  50000.0
1    Bob  30.0         IT  60000.0

In [40]:
df.tail(2)

    Name   Age Department   Salary
4    Eve  29.0         HR      NaN
5  Alice  25.0         HR  50000.0

In [41]:
# loc and iloc

df.iloc[1:3]

      Name   Age Department   Salary
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0

In [42]:
df.loc[:,'Department']

0         HR
1         IT
2    Finance
3         IT
4         HR
5         HR
Name: Department, dtype: object

In [43]:
df.loc[1:3,['Age',"Department"]]

    Age Department
1  30.0         IT
2  35.0    Finance
3   NaN         IT

In [44]:
df[['Age','Department']]

    Age Department
0  25.0         HR
1  30.0         IT
2  35.0    Finance
3   NaN         IT
4  29.0         HR
5  25.0         HR

In [45]:
df.drop('Age',axis=1)# axis =1 is means columns index and axis=0 means Row index

      Name Department   Salary
0    Alice         HR  50000.0
1      Bob         IT  60000.0
2  Charlie    Finance  70000.0
3    David         IT  62000.0
4      Eve         HR      NaN
5    Alice         HR  50000.0

In [46]:
df

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN
5    Alice  25.0         HR  50000.0

In [47]:
df.drop('Age',axis=1,inplace=True) # changes with the original datafram

In [48]:
df

      Name Department   Salary
0    Alice         HR  50000.0
1      Bob         IT  60000.0
2  Charlie    Finance  70000.0
3    David         IT  62000.0
4      Eve         HR      NaN
5    Alice         HR  50000.0

In [49]:
df.shape

(6, 3)

In [59]:
# i have inserted 2nd  times data
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve", "Alice"],
    "Age": [25, 30, 35, np.nan, 29, 25],
    "Department": ["HR", "IT", "Finance", "IT", "HR", "HR"],
    "Salary": [50000, 60000, 70000, 62000, np.nan, 50000]
}

In [60]:
data

{'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Alice'],
 'Age': [25, 30, 35, nan, 29, 25],
 'Department': ['HR', 'IT', 'Finance', 'IT', 'HR', 'HR'],
 'Salary': [50000, 60000, 70000, 62000, nan, 50000]}

In [61]:
df=pd.DataFrame(data)
df

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN
5    Alice  25.0         HR  50000.0

In [62]:
df.shape

(6, 4)

In [63]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        6 non-null      object
 1   Age         5 non-null      float64
 2   Department  6 non-null      object
 3   Salary      5 non-null      float64
dtypes: float64(2), object(2)
memory usage: 324.0+ bytes

In [64]:
df.describe()

             Age        Salary
count   5.000000      5.000000
mean   28.800000  58400.000000
std     4.147288   8532.291603
min    25.000000  50000.000000
25%    25.000000  50000.000000
50%    29.000000  60000.000000
75%    30.000000  62000.000000
max    35.000000  70000.000000

In [65]:
df['Salary'].values

array([50000., 60000., 70000., 62000.,    nan, 50000.])

In [66]:
# Broadcasting 

df['Salary']=df['Salary'] + 5000

In [67]:
df['Salary']

0    55000.0
1    65000.0
2    75000.0
3    67000.0
4        NaN
5    55000.0
Name: Salary, dtype: float64

In [68]:
# Renaming Columns:

df.rename(columns={"Department":"Dept"},inplace= True)

In [69]:
df

      Name   Age     Dept   Salary
0    Alice  25.0       HR  55000.0
1      Bob  30.0       IT  65000.0
2  Charlie  35.0  Finance  75000.0
3    David   NaN       IT  67000.0
4      Eve  29.0       HR      NaN
5    Alice  25.0       HR  55000.0

In [70]:
df['Salary'].unique()

array([55000., 65000., 75000., 67000.,    nan])

In [71]:
df['Dept'].unique()

array(['HR', 'IT', 'Finance'], dtype=object)

In [73]:
df['Dept'].value_counts()

Dept
HR         3
IT         2
Finance    1
Name: count, dtype: int64

In [74]:
# Broadcasting

df['Promoted Salary']=df["Salary"] * 10

In [75]:
df

      Name   Age     Dept   Salary  Promoted Salary
0    Alice  25.0       HR  55000.0         550000.0
1      Bob  30.0       IT  65000.0         650000.0
2  Charlie  35.0  Finance  75000.0         750000.0
3    David   NaN       IT  67000.0         670000.0
4      Eve  29.0       HR      NaN              NaN
5    Alice  25.0       HR  55000.0         550000.0

In [76]:
# Data Cleaning 

df.isnull().sum()

Name               0
Age                1
Dept               0
Salary             1
Promoted Salary    1
dtype: int64

In [80]:
df.dropna(how='any') # any row that had any null values

      Name   Age     Dept   Salary  Promoted Salary
0    Alice  25.0       HR  55000.0         550000.0
1      Bob  30.0       IT  65000.0         650000.0
2  Charlie  35.0  Finance  75000.0         750000.0
5    Alice  25.0       HR  55000.0         550000.0

In [81]:
df.dropna(how='all') # if all the values in any row ara null the we drop.

      Name   Age     Dept   Salary  Promoted Salary
0    Alice  25.0       HR  55000.0         550000.0
1      Bob  30.0       IT  65000.0         650000.0
2  Charlie  35.0  Finance  75000.0         750000.0
3    David   NaN       IT  67000.0         670000.0
4      Eve  29.0       HR      NaN              NaN
5    Alice  25.0       HR  55000.0         550000.0

Handel with missing values 

1. getting rid --> dropna()
2. filling them up --> fillna()

In [82]:
df.fillna(0)

      Name   Age     Dept   Salary  Promoted Salary
0    Alice  25.0       HR  55000.0         550000.0
1      Bob  30.0       IT  65000.0         650000.0
2  Charlie  35.0  Finance  75000.0         750000.0
3    David   0.0       IT  67000.0         670000.0
4      Eve  29.0       HR      0.0              0.0
5    Alice  25.0       HR  55000.0         550000.0

In [84]:
df["Age"].fillna(df["Age"].mean()) #you can use inplace is Ture

0    25.0
1    30.0
2    35.0
3    28.8
4    29.0
5    25.0
Name: Age, dtype: float64

In [85]:
df['Salary'].fillna(df['Salary'].mean())

0    55000.0
1    65000.0
2    75000.0
3    67000.0
4    63400.0
5    55000.0
Name: Salary, dtype: float64

In fillna have 2 methods

1. Forward fill
2. Backward fill

In [86]:
df['Age'].fillna(method='ffill')

C:\Users\hp\AppData\Local\Temp\ipykernel_3868\1265906299.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df['Age'].fillna(method='ffill')

0    25.0
1    30.0
2    35.0
3    35.0
4    29.0
5    25.0
Name: Age, dtype: float64

In [87]:
df['Age'].fillna(method='bfill')

C:\Users\hp\AppData\Local\Temp\ipykernel_3868\3224957626.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df['Age'].fillna(method='bfill')

0    25.0
1    30.0
2    35.0
3    29.0
4    29.0
5    25.0
Name: Age, dtype: float64

In [88]:
df

      Name   Age     Dept   Salary  Promoted Salary
0    Alice  25.0       HR  55000.0         550000.0
1      Bob  30.0       IT  65000.0         650000.0
2  Charlie  35.0  Finance  75000.0         750000.0
3    David   NaN       IT  67000.0         670000.0
4      Eve  29.0       HR      NaN              NaN
5    Alice  25.0       HR  55000.0         550000.0

In [92]:
df['Name']=df['Name'].replace("Charlie","Rose")
df

    Name   Age     Dept   Salary  Promoted Salary
0  Alice  25.0       HR  55000.0         550000.0
1    Bob  30.0       IT  65000.0         650000.0
2   Rose  35.0  Finance  75000.0         750000.0
3  David   NaN       IT  67000.0         670000.0
4    Eve  29.0       HR      NaN              NaN
5  Alice  25.0       HR  55000.0         550000.0

In [96]:
# Duplicates:

df_dup= df[df.duplicated(keep="first")]
df_dup

    Name   Age Dept   Salary  Promoted Salary
5  Alice  25.0   HR  55000.0         550000.0

In [98]:
df_dup=df[df.duplicated(keep="last")]
df_dup

    Name   Age Dept   Salary  Promoted Salary
0  Alice  25.0   HR  55000.0         550000.0

In [101]:
# remove duplicate values

df=df.drop_duplicates()
df

    Name   Age     Dept   Salary  Promoted Salary
0  Alice  25.0       HR  55000.0         550000.0
1    Bob  30.0       IT  65000.0         650000.0
2   Rose  35.0  Finance  75000.0         750000.0
3  David   NaN       IT  67000.0         670000.0
4    Eve  29.0       HR      NaN              NaN

In [103]:
## invalid Values:
# lambda --> python

df['Promoted Salary']=df["Promoted Salary"].apply(lambda x: x/10 if x >650000 else x)
df

    Name   Age     Dept   Salary  Promoted Salary
0  Alice  25.0       HR  55000.0         550000.0
1    Bob  30.0       IT  65000.0         650000.0
2   Rose  35.0  Finance  75000.0          75000.0
3  David   NaN       IT  67000.0          67000.0
4    Eve  29.0       HR      NaN              NaN

In [ ]:
name='alice_fernandes'
df[['first_name', 'last_name']] = df['name'].str.split("_")

In [105]:
# apply and lambda 
def multiplying_age(x):
    return x*2

df['Age'] = df['Age'].apply(multiplying_age)

In [106]:
df

    Name   Age     Dept   Salary  Promoted Salary
0  Alice  50.0       HR  55000.0         550000.0
1    Bob  60.0       IT  65000.0         650000.0
2   Rose  70.0  Finance  75000.0          75000.0
3  David   NaN       IT  67000.0          67000.0
4    Eve  58.0       HR      NaN              NaN

In [107]:
df['Age']=df['Age'].apply(lambda x: x/2)

In [108]:
df

    Name   Age     Dept   Salary  Promoted Salary
0  Alice  25.0       HR  55000.0         550000.0
1    Bob  30.0       IT  65000.0         650000.0
2   Rose  35.0  Finance  75000.0          75000.0
3  David   NaN       IT  67000.0          67000.0
4    Eve  29.0       HR      NaN              NaN

In [109]:
# Joins and Merges


department_info = {
    "Dept": ["HR", "IT", "Finance"],
    "Location": ["New York", "San Francisco", "Chicago"],
    "Manager": ["Laura", "Steve", "Nina"]
}

df2 = pd.DataFrame(department_info)

In [110]:
df2

      Dept       Location Manager
0       HR       New York   Laura
1       IT  San Francisco   Steve
2  Finance        Chicago    Nina

In [111]:
# Concat

pd.concat([df,df2])

    Name   Age     Dept   Salary  Promoted Salary       Location Manager
0  Alice  25.0       HR  55000.0         550000.0            NaN     NaN
1    Bob  30.0       IT  65000.0         650000.0            NaN     NaN
2   Rose  35.0  Finance  75000.0          75000.0            NaN     NaN
3  David   NaN       IT  67000.0          67000.0            NaN     NaN
4    Eve  29.0       HR      NaN              NaN            NaN     NaN
0    NaN   NaN       HR      NaN              NaN       New York   Laura
1    NaN   NaN       IT      NaN              NaN  San Francisco   Steve
2    NaN   NaN  Finance      NaN              NaN        Chicago    Nina

In [112]:
pd.concat([df,df2],axis=1)

,Name,Age,Dept,Salary,Promoted Salary,Dept,Location,Manager
0,Alice,25.0,HR,55000.0,550000.0,HR,New York,Laura
1,Bob,30.0,IT,65000.0,650000.0,IT,San Francisco,Steve
2,Rose,35.0,Finance,75000.0,75000.0,Finance,Chicago,Nina
3,David,NaN,IT,67000.0,67000.0,NaN,NaN,NaN
4,Eve,29.0,HR,NaN,NaN,NaN,NaN,NaN

In [114]:
pd.merge(df, df2, on ="Dept")

    Name   Age     Dept   Salary  Promoted Salary       Location Manager
0  Alice  25.0       HR  55000.0         550000.0       New York   Laura
1    Bob  30.0       IT  65000.0         650000.0  San Francisco   Steve
2   Rose  35.0  Finance  75000.0          75000.0        Chicago    Nina
3  David   NaN       IT  67000.0          67000.0  San Francisco   Steve
4    Eve  29.0       HR      NaN              NaN       New York   Laura

In [ ]:
# if data time format dtype is object

# use this to convert into datetim[na]

# data['date']=pd.to_datetime(data['date'])
# data.info()